/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_adc.c
 * @brief Low level HAL ADC source file.
 */

#include "hal_ll_adc.h"
#include "hal_ll_gpio.h"
#include "hal_ll_adc_pin_map.h"
#include "hal_ll_cg.h"

// ------------------------------------------------------------- PRIVATE MACROS

/*!< @brief Helper macro for getting hal_ll_module_state address */
#define hal_ll_adc_get_module_state_address ((hal_ll_adc_handle_register_t *)*handle)
/*!< @brief Helper macro for getting module specific control register structure base address // first register address */
#define hal_ll_adc_get_handle (hal_ll_adc_handle_register_t *)hal_ll_adc_get_module_state_address->hal_ll_adc_handle
/*!< @brief Helper macro for getting module specific control register structure */
#define hal_ll_adc_get_base_struct(_handle) ((hal_ll_adc_base_handle_t *)_handle)
/*!< @brief Helper macro for getting module specific base address directly from HAL layer handle */
#define hal_ll_adc_get_base_from_hal_handle ((hal_ll_adc_hw_specifics_map_t *)((hal_ll_adc_handle_register_t *)\
                                            (((hal_ll_adc_handle_register_t *)(handle))->hal_ll_adc_handle))->hal_ll_adc_handle)->base

/*!< @brief Helper macro for getting adequate module index number. */
#define hal_ll_adc_module_num(_module_num)      (_module_num - 1)

#define HAL_LL_CG_ADC0_BIT 2
#define HAL_LL_CG_ADC1_BIT 3
#define HAL_LL_CG_ADC2_BIT 4

#define ADxMOD0_DACON_mask          (0x01U << 0)
#define ADxCR0_ADEN_mask            (0x01U << 7)
#define ADxCR0_SGL_mask             (0x01U << 1)
#define ADxST_SNGF_mask             (0x01U << 2)
#define ADC_RESULT_MASK             (0x0FFFU)

#define ADxCLK_160M_SCLK40M_EXAZ0   (0x00000008U)  // VADCLK=000, EXAZ0=0001, EXAZ1=0000

// -------------------------------------------------------------- PRIVATE TYPES
/*!< @brief Local handle list. */
static hal_ll_adc_handle_register_t hal_ll_module_state[ ADC_MODULE_COUNT ] = { (handle_t *) NULL, (handle_t *) NULL, false };

/*!< @brief ADC register structure. */
typedef struct {
    uint32_t cr0;          // 0x0000 - Control Register0
    uint32_t cr1;          // 0x0004 - Control Register1
    uint32_t st;           // 0x0008 - Status Register
    uint32_t clk;          // 0x000C - Conversion Clock Setting Register
    uint32_t mod0;         // 0x0010 - Mode Setting Reg0
    uint32_t mod1;         // 0x0014 - Mode Setting Reg1
    uint32_t mod2;         // 0x0018 - Mode Setting Reg2
    uint32_t reserved0;    // 0x001C - Reserved
    uint32_t cmpen;        // 0x0020 - Monitor Function Enable Register
    uint32_t cmpcr0;       // 0x0024 - Monitor Function Setting Reg0
    uint32_t cmpcr1;       // 0x0028 - Monitor Function Setting Reg1
    uint32_t cmp0;         // 0x002C - Conversion Result Comparison Reg0
    uint32_t cmp1;         // 0x0030 - Conversion Result Comparison Reg1
    uint32_t _unused1[3];  // 0x0034-0x003C - Reserved
    uint32_t psel0;        // 0x0040 - PMD Trigger Program Number Selection Reg0
    uint32_t psel1;        // 0x0044 - PMD Trigger Program Number Selection Reg1
    uint32_t psel2;        // 0x0048 - PMD Trigger Program Number Selection Reg2
    uint32_t psel3;        // 0x004C - PMD Trigger Program Number Selection Reg3
    uint32_t psel4;        // 0x0050 - PMD Trigger Program Number Selection Reg4
    uint32_t psel5;        // 0x0054 - PMD Trigger Program Number Selection Reg5
    uint32_t psel6;        // 0x0058 - PMD Trigger Program Number Selection Reg6
    uint32_t psel7;        // 0x005C - PMD Trigger Program Number Selection Reg7
    uint32_t psel8;        // 0x0060 - PMD Trigger Program Number Selection Reg8
    uint32_t psel9;        // 0x0064 - PMD Trigger Program Number Selection Reg9
    uint32_t psel10;       // 0x0068 - PMD Trigger Program Number Selection Reg10
    uint32_t psel11;       // 0x006C - PMD Trigger Program Number Selection Reg11
    uint32_t pints0;       // 0x0070 - PMD Trigger Interrupt Selection Reg0
    uint32_t pints1;       // 0x0074 - PMD Trigger Interrupt Selection Reg1
    uint32_t pints2;       // 0x0078 - PMD Trigger Interrupt Selection Reg2 
    uint32_t pints3;       // 0x007C - PMD Trigger Interrupt Selection Reg3
    uint32_t pints4;       // 0x0080 - PMD Trigger Interrupt Selection Reg4
    uint32_t pints5;       // 0x0084 - PMD Trigger Interrupt Selection Reg5
    uint32_t pints6;       // 0x0088 - PMD Trigger Interrupt Selection Reg6
    uint32_t pints7;       // 0x008C - PMD Trigger Interrupt Selection Reg7
    uint32_t pregs;        // 0x0090 - PMD Trigger Storage Selection Register
    uint32_t _unused2[2];  // 0x0094-0x0098 - Reserved
    uint32_t exazsel;      // 0x009C - AIN Sampling Time Selection Register
    uint32_t pset0;        // 0x00A0 - PMD Trigger Program Reg0
    uint32_t pset1;        // 0x00A4 - PMD Trigger Program Reg1
    uint32_t pset2;        // 0x00A8 - PMD Trigger Program Reg2
    uint32_t pset3;        // 0x00AC - PMD Trigger Program Reg3
    uint32_t pset4;        // 0x00B0 - PMD Trigger Program Reg4
    uint32_t pset5;        // 0x00B4 - PMD Trigger Program Reg5
    uint32_t pset6;        // 0x00B8 - PMD Trigger Program Reg6
    uint32_t pset7;        // 0x00BC - PMD Trigger Program Reg7
    uint32_t tset0;        // 0x00C0 - General Purpose Start-up Factor Program Reg0
    uint32_t tset1;        // 0x00C4 - General Purpose Start-up Factor Program Reg1
    uint32_t tset2;        // 0x00C8 - General Purpose Start-up Factor Program Reg2
    uint32_t tset3;        // 0x00CC - General Purpose Start-up Factor Program Reg3
    uint32_t tset4;        // 0x00D0 - General Purpose Start-up Factor Program Reg4
    uint32_t tset5;        // 0x00D4 - General Purpose Start-up Factor Program Reg5
    uint32_t tset6;        // 0x00D8 - General Purpose Start-up Factor Program Reg6
    uint32_t tset7;        // 0x00DC - General Purpose Start-up Factor Program Reg7
    uint32_t tset8;        // 0x00E0 - General Purpose Start-up Factor Program Reg8
    uint32_t tset9;        // 0x00E4 - General Purpose Start-up Factor Program Reg9
    uint32_t tset10;       // 0x00E8 - General Purpose Start-up Factor Program Reg10
    uint32_t tset11;       // 0x00EC - General Purpose Start-up Factor Program Reg11
    uint32_t tset12;       // 0x00F0 - General Purpose Start-up Factor Program Reg12
    uint32_t tset13;       // 0x00F4 - General Purpose Start-up Factor Program Reg13
    uint32_t tset14;       // 0x00F8 - General Purpose Start-up Factor Program Reg14
    uint32_t tset15;       // 0x00FC - General Purpose Start-up Factor Program Reg15
    uint32_t tset16;       // 0x0100 - General Purpose Start-up Factor Program Reg16
    uint32_t tset17;       // 0x0104 - General Purpose Start-up Factor Program Reg17
    uint32_t tset18;       // 0x0108 - General Purpose Start-up Factor Program Reg18
    uint32_t tset19;       // 0x010C - General Purpose Start-up Factor Program Reg19
    uint32_t tset20;       // 0x0110 - General Purpose Start-up Factor Program Reg20
    uint32_t tset21;       // 0x0114 - General Purpose Start-up Factor Program Reg21
    uint32_t tset22;       // 0x0118 - General Purpose Start-up Factor Program Reg22
    uint32_t tset23;       // 0x011C - General Purpose Start-up Factor Program Reg23
    uint32_t _unused3[8];  // 0x0120-0x013C - Reserved
    uint32_t reg0;         // 0x0140 - Conversion Result Storage Reg0
    uint32_t reg1;         // 0x0144 - Conversion Result Storage Reg1
    uint32_t reg2;         // 0x0148 - Conversion Result Storage Reg2
    uint32_t reg3;         // 0x014C - Conversion Result Storage Reg3
    uint32_t reg4;         // 0x0150 - Conversion Result Storage Reg4
    uint32_t reg5;         // 0x0154 - Conversion Result Storage Reg5
    uint32_t reg6;         // 0x0158 - Conversion Result Storage Reg6
    uint32_t reg7;         // 0x015C - Conversion Result Storage Reg7
    uint32_t reg8;         // 0x0160 - Conversion Result Storage Reg8
    uint32_t reg9;         // 0x0164 - Conversion Result Storage Reg9
    uint32_t reg10;        // 0x0168 - Conversion Result Storage Reg10
    uint32_t reg11;        // 0x016C - Conversion Result Storage Reg11
    uint32_t reg12;        // 0x0170 - Conversion Result Storage Reg12
    uint32_t reg13;        // 0x0174 - Conversion Result Storage Reg13
    uint32_t reg14;        // 0x0178 - Conversion Result Storage Reg14
    uint32_t reg15;        // 0x017C - Conversion Result Storage Reg15
    uint32_t reg16;        // 0x0180 - Conversion Result Storage Reg16
    uint32_t reg17;        // 0x0184 - Conversion Result Storage Reg17
    uint32_t reg18;        // 0x0188 - Conversion Result Storage Reg18
    uint32_t reg19;        // 0x018C - Conversion Result Storage Reg19
    uint32_t reg20;        // 0x0190 - Conversion Result Storage Reg20
    uint32_t reg21;        // 0x0194 - Conversion Result Storage Reg21
    uint32_t reg22;        // 0x0198 - Conversion Result Storage Reg22
    uint32_t reg23;        // 0x019C - Conversion Result Storage Reg23
} hal_ll_adc_base_handle_t;

/**
 *  Return values.
 */
typedef enum {
    HAL_LL_ADC_SUCCESS = 0,
    HAL_LL_ADC_WRONG_PIN,

    HAL_LL_ADC_UNSUPPORTED_RESOLUTION = 1100,
    HAL_LL_ADC_UNSUPPORTED_VREF,
    HAL_LL_ADC_WRONG_CHANNEL,
    HAL_LL_ADC_ERROR = (-1)
} hal_ll_adc_err_t;

/*!< @brief ADC hw specific module values. */
typedef struct {
    uint16_t pin_an[ADC_MODULE_COUNT];
} hal_ll_adc_pin_id;

// ---------------------------------------------------------- PRIVATE VARIABLES
/**
 * @brief Array of maps holding information for configuring hardware.
 */
static hal_ll_adc_hw_specifics_map_t hal_ll_adc_hw_specifics_map[ADC_MODULE_COUNT + 1] = {
    #ifdef ADC_MODULE_0
    {HAL_LL_ADC0_BASE_ADDR, hal_ll_adc_module_num( ADC_MODULE_0 ), HAL_LL_PIN_NC,
     HAL_LL_ADC_VREF_DEFAULT, 0, HAL_LL_ADC_RESOLUTION_12_BIT, 0xFF},
    #endif
    #ifdef ADC_MODULE_1
