/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,

#define T32A_CR_UPDN_POS                  (16u)  
#define T32A_CR_WBF_POS                   (20u) 
#define T32A_CR_CLK_POS                   (24u)  
#define CR_PRESCL_POS                     (28u)

#define TSB_CG_FSYSMENA                   (*(volatile uint32_t *)HAL_LL_CG_BASE_FSYSMENA_ADDR)
#define TSB_CG_FSYSMENB                   (*(volatile uint32_t *)HAL_LL_CG_BASE_FSYSMENB_ADDR)
#define TSB_CG_PROTECT                    (*(volatile uint32_t *)HAL_LL_CG_BASE_PROTECT_ADDR)

#define HAL_LL_CG_PROTECT_OPEN_KEY        (0xC1u)  
#define HAL_LL_CG_PROTECT_CLOSE_KEY       (0x00u) 


static inline void hal_ll_cg_protect_open(void)  { TSB_CG_PROTECT = HAL_LL_CG_PROTECT_OPEN_KEY;  }
static inline void hal_ll_cg_protect_close(void) { TSB_CG_PROTECT = HAL_LL_CG_PROTECT_CLOSE_KEY; }


#define TSB_CG_FSYSMENA_IPMENA28_POS      (28u)
#define TSB_CG_FSYSMENA_IPMENA29_POS      (29u)
#define TSB_CG_FSYSMENA_IPMENA30_POS      (30u)
#define TSB_CG_FSYSMENA_IPMENA31_POS      (31u)
#define TSB_CG_FSYSMENB_IPMENB00_POS      (0u)
#define TSB_CG_FSYSMENB_IPMENB01_POS      (1u)

#define HAL_LL_BIT(POS)                   ((uint32_t)1u << (POS))
#define HAL_LL_MASK(WIDTH, POS)           ((((uint32_t)1u << (WIDTH)) - 1u) << (POS))

#define HAL_LL_SET_BIT(REG, POS)          ((REG) |=  HAL_LL_BIT(POS))
#define HAL_LL_CLR_BIT(REG, POS)          ((REG) &= ~HAL_LL_BIT(POS))
#define HAL_LL_WRITE_BIT(REG, POS, VAL) do { if (VAL) (REG) |= HAL_LL_BIT(POS); else (REG) &= ~HAL_LL_BIT(POS); } while (0)

#define HAL_LL_DUTY_RATIO_MIN             (0.0f)
#define HAL_LL_DUTY_RATIO_MAX             (1.0f)
#define HAL_LL_ROUNDING_BIAS              (0.5f)
#define HAL_LL_ONE_TICK                   (1u)

#define T32A_RUN_RG0_EN_POS               (0u)
#define T32A_RUN_RG1_EN_POS               (1u)

#define T32A_RUN_RG0_EN                   HAL_LL_BIT(T32A_RUN_RG0_EN_POS)
#define T32A_RUN_RG1_EN                   HAL_LL_BIT(T32A_RUN_RG1_EN_POS)

#define T32A_RUN_START_BOTH               (T32A_RUN_RG0_EN | T32A_RUN_RG1_EN)
#define T32A_RUN_STOP_ALL                 (0u) 

#define HAL_LL_DEFAULT_TIM_CLK_HZ         (60000000u)
#define HAL_LL_DEFAULT_PWM_HZ             (1000u)

#define HAL_LL_DIV_1                      (1u)
#define HAL_LL_DIV_2                      (2u)
#define HAL_LL_DIV_8                      (8u)
#define HAL_LL_DIV_32                     (32u)
#define HAL_LL_DIV_128                    (128u)
#define HAL_LL_DIV_256                    (256u)
#define HAL_LL_DIV_512                    (512u)
#define HAL_LL_DIV_1024                   (1024u)

#define T32A_COUNTER_TOP_MAX              (0xFFFFu)
#define T32A_COUNTER_RANGE                ((uint32_t)T32A_COUNTER_TOP_MAX + 1u)  
#define HAL_LL_MIN_TICKS                  (2u)  

#define HAL_LL_ROUNDING_DIV               (2u)

#define T32A_CR_PRESC_POS                 (CR_PRESCL_POS)                
#define T32A_CR_PRESC_MSK                 ( HAL_LL_MASK(3u, T32A_CR_PRESC_POS) ) 
#define T32A_CR_PRESC(V)                  ( (uint32_t)(V) << T32A_CR_PRESC_POS )
  
typedef struct {
    uint32_t CG_FC_Frequency;
    uint32_t CG_FSYSH_Frequency;
    uint32_t CG_FSYSM_Frequency;
    uint32_t CG_FT0H_Frequency;  
    uint32_t CG_FT0M_Frequency;
} CG_ClocksTypeDef;

extern void CG_GetClocksFrequency(CG_ClocksTypeDef *CG_Clocks);
static inline uint32_t _tim_input_clk_hz(void)
{
    CG_ClocksTypeDef clks;
    CG_GetClocksFrequency(&clks);
    return clks.CG_FT0H_Frequency;
}
 
#define T32A_OUTCRx1_RG0(ACT)   ((uint32_t)(ACT) << T32A_OUTCRx1_RG0_POS)
#define T32A_OUTCRx1_RG1(ACT)   ((uint32_t)(ACT) << T32A_OUTCRx1_RG1_POS)

#define HAL_LL_TIM_OUTCR_CLEAR_RG0_SET_RG1 \
        ( T32A_OUTCRx1_RG0(T32A_OUT_ACT_CLEAR) | T32A_OUTCRx1_RG1(T32A_OUT_ACT_SET) )

// -------------------------------------------------------------- PRIVATE TYPES
/*!< @brief TIM register structure. */
typedef struct
{
   /* ==== Common register ==== */
    uint32_t mod;                        /* 0x0000 - Mode Register */

    uint32_t _unused0[15];               /* 0x0004 - 0x003C : Reserved */

    /* ==== Timer A Registers ==== */
    uint32_t runa;                       /* 0x0040 - Run Register A */
    uint32_t cra;                        /* 0x0044 - Counter Control Register A */
    uint32_t capcra;                     /* 0x0048 - Capture Control Register A */
    uint32_t outcra0;                    /* 0x004C - Output Control Register A0 */
    uint32_t outcra1;                    /* 0x0050 - Output Control Register A1 */
    uint32_t sta;                        /* 0x0054 - Status Register A */
    uint32_t ima;                        /* 0x0058 - Interrupt Mask Register A */
    uint32_t tmra;                       /* 0x005C - Counter Capture Register A */
    uint32_t relda;                      /* 0x0060 - Counter Reload Register A */
    uint32_t rga0;                       /* 0x0064 - Timer Register A0 */
    uint32_t rga1;                       /* 0x0068 - Timer Register A1 */
    uint32_t capa0;                      /* 0x006C - Capture Register A0 */
    uint32_t capa1;                      /* 0x0070 - Capture Register A1 */
    uint32_t dmaa;                       /* 0x0074 - DMA Request Enable Register A */
    uint32_t cpa0;                       /* 0x0078 - Compare Register A0 */
    uint32_t cpa1;                       /* 0x007C - Compare Register A1 */

    /* ==== Timer B Registers ==== */
    uint32_t runb;                       /* 0x0080 - Run Register B */
    uint32_t crb;                        /* 0x0084 - Counter Control Register B */
    uint32_t capcrb;                     /* 0x0088 - Capture Control Register B */
    uint32_t outcrb0;                    /* 0x008C - Output Control Register B0 */
    uint32_t outcrb1;                    /* 0x0090 - Output Control Register B1 */
    uint32_t stb;                        /* 0x0094 - Status Register B */
    uint32_t imb;                        /* 0x0098 - Interrupt Mask Register B */
    uint32_t tmrb;                       /* 0x009C - Counter Capture Register B */
    uint32_t reldb;                      /* 0x00A0 - Counter Reload Register B */
    uint32_t rgb0;                       /* 0x00A4 - Timer Register B0 */
    uint32_t rgb1;                       /* 0x00A8 - Timer Register B1 */
    uint32_t capb0;                      /* 0x00AC - Capture Register B0 */
    uint32_t capb1;                      /* 0x00B0 - Capture Register B1 */
    uint32_t dmab;                       /* 0x00B4 - DMA Request Enable Register B */
    uint32_t cpb0;                       /* 0x00B8 - Compare Register B0 */
    uint32_t cpb1;                       /* 0x00BC - Compare Register B1 */

    /* ==== Timer C Registers ==== */
    uint32_t runc;                       /* 0x00C0 - Run Register C */
    uint32_t crc;                        /* 0x00C4 - Counter Control Register C */
    uint32_t capcrc;                     /* 0x00C8 - Capture Control Register C */
    uint32_t outcrc0;                    /* 0x00CC - Output Control Register C0 */
    uint32_t outcrc1;                    /* 0x00D0 - Output Control Register C1 */
    uint32_t stc;                        /* 0x00D4 - Status Register C */
    uint32_t imc;                        /* 0x00D8 - Interrupt Mask Register C */
    uint32_t tmrc;                       /* 0x00DC - Counter Capture Register C */
    uint32_t reldc;                      /* 0x00E0 - Counter Reload Register C */
    uint32_t rgc0;                       /* 0x00E4 - Timer Register C0 */
    uint32_t rgc1;                       /* 0x00E8 - Timer Register C1 */
    uint32_t capc0;                      /* 0x00EC - Capture Register C0 */
    uint32_t capc1;                      /* 0x00F0 - Capture Register C1 */
    uint32_t dmac;                       /* 0x00F4 - DMA Request Enable Register C */
    uint32_t plscr;                      /* 0x00F8 - Pulse Count Control Register */
    uint32_t cpc0;                       /* 0x00FC - Compare Register C0 */
    uint32_t cpc1;                       /* 0x0100 - Compare Register C1 */
} hal_ll_tim_base_handle_t;

/*!< @brief TIM pin structure */
typedef struct
{
    hal_ll_pin_name_t pin;
    hal_ll_tim_pin_type_t pin_type;
    uint32_t af;
} hal_ll_tim_t;

/*!< @brief TIM hw specific structure */
typedef struct
{
    hal_ll_base_addr_t  base;
    hal_ll_tim_t        config;
    uint16_t            max_period;
    uint32_t            freq_hz;
    hal_ll_pin_name_t   module_index;
} hal_ll_tim_hw_specifics_map_t;

/*!< @brief TIM hw specific error values */
typedef enum
{
    HAL_LL_TIM_SUCCESS = 0,
    HAL_LL_TIM_MODULE_ERROR,
    HAL_LL_TIM_WRONG_PIN,

    HAL_LL_TIM_ERROR = (-1)
} hal_ll_tim_err_t;

// ------------------------------------------------------------------ VARIABLES
/*!< @brief TIM specific info */
static hal_ll_tim_hw_specifics_map_t hal_ll_tim_hw_specifics_map[] =
{
    #ifdef TIM_MODULE_0
